Revit 2026 API

# ParameterFilterElementCreate(Document, String, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ParameterFilterElement Create(
	Document aDocument,
	string name,
	ICollection<ElementId> categories
)
```
```vb
Public Shared Function Create (
	aDocument As Document,
	name As String,
	categories As ICollection(Of ElementId)
) As ParameterFilterElement
```
```cpp
public:
static ParameterFilterElement^ Create(
	Document^ aDocument,
	String^ name,
	ICollection<ElementId^>^ categories
)
```
```fsharp
static member Create :
        aDocument : Document *
        name : string *
        categories : ICollection<ElementId> -> ParameterFilterElement
```

#### Parameters

aDocument Document

name String

categories ICollectionElementId

#### Return Value

ParameterFilterElement

#### Reference

ParameterFilterElement Class

Create Overload

Autodesk.Revit.DB Namespace